##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения с остатком.

x = 10
y = 5
c= x+y
print (c)
c=x-y
print (c)
c= x/y
print (c)
c = x*y
print(c)
print (7/2)
c=x**y
print (c)